In [180]:
# Dependencies and Setup
import pandas as pd

In [181]:
# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

In [183]:
purchase_data_df = pd.read_csv(file_to_load)
purchase_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [186]:
pd.crosstab(purchase_data_df["SN"], purchase_data_df["Gender"])

Gender         Female  Male  Other / Non-Disclosed
SN
Adairialis76        0     1                      0
Adastirin33         1     0                      0
Aeda94              0     1                      0
Aela59              0     1                      0
Aelaria33           0     1                      0
...               ...   ...                    ...
Yathecal82          3     0                      0
Yathedeu43          0     2                      0
Yoishirrala98       1     0                      0
Zhisrisu83          0     2                      0
Zontibe81           0     3                      0

[576 rows x 3 columns]

In [185]:
total_count = len(pd.crosstab(purchase_data_df["SN"], purchase_data_df["Gender"]))
total_count

576

In [143]:
unique_genders = purchase_data_df.groupby(["Gender"])["SN"].nunique()
unique_genders

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [144]:
female_count = unique_genders["Female"]
female_count

81

In [145]:
male_count = unique_genders["Male"]
male_count

484

In [146]:
others_count = unique_genders["Other / Non-Disclosed"]
others_count

11

In [203]:
summary_output3 = [{" ": "Male", "Total Count": male_count, "Percentage of Players": ((male_count / total_count)*100) },
             {" ": "Female", "Total Count": female_count, "Percentage of Players": ((female_count / total_count)*100) },
{" ": "Other / Non-Disclosed", "Total Count": others_count, "Percentage of Players": ((others_count / total_count)*100) }]
output3_df = pd.DataFrame(summary_output3)
output3_df

                          Total Count  Percentage of Players
0                   Male          484              84.027778
1                 Female           81              14.062500
2  Other / Non-Disclosed           11               1.909722

In [204]:
# Use Map to format all the columns
output3_df["Percentage of Players"] = output3_df["Percentage of Players"].map("{:.2f}%".format)
output3_df

                          Total Count Percentage of Players
0                   Male          484                84.03%
1                 Female           81                14.06%
2  Other / Non-Disclosed           11                 1.91%

In [147]:
count = purchase_data_df["Gender"].value_counts()
count

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [148]:
unique_df = purchase_data_df["SN"].unique()
lenght_df = len(unique_df)
lenght_df

576

In [149]:
# Finding the value count  of "SN" column 
total_players_df = purchase_data_df["SN"].value_counts()
total_players_df

Lisosia93        5
Idastidru52      4
Iral74           4
Zontibe81        3
Inguron55        3
                ..
Lassirrasda85    1
Saisrilis27      1
Undjask33        1
Asty82           1
Eulae84          1
Name: SN, Length: 576, dtype: int64

In [150]:
output_list = [{"Total_Players": len(total_players_df)}]
output1_df = pd.DataFrame(output_list)
output1_df

   Total_Players
0            576

In [151]:
Total_Players = len(total_players_df)
Total_Players

576

In [152]:
# The unique method shows every element of the series that appears only once
unique_items = len(purchase_data_df["Item ID"].unique())
unique_items

179

In [153]:
# Create a new dataframe of the of the group of unique items
item_group = purchase_data_df.groupby(["Item ID"])
unique_item = item_group.sum()
unique_item

         Purchase ID  Age  Price
Item ID
0               1149   74   5.12
1               1523   89  11.77
2               2006  143  14.88
3               2087  155  14.94
4               1885  124   8.50
...              ...  ...    ...
178             4960  287  50.76
179             1948  126  26.88
181             1278  109   8.30
182             1327   67  12.09
183             1488   66   3.27

[179 rows x 3 columns]

In [154]:
num_unique_items = len(unique_item)
num_unique_items

179

In [155]:
average = purchase_data_df["Price"].mean()
average

3.0509871794871795

In [156]:
average_price = round(average, 2)
average_price

3.05

In [157]:
num_purchases = len(purchase_data_df["Purchase ID"])
num_purchases

780

In [158]:
total_revenue = (purchase_data_df["Price"]).sum()
total_revenue

2379.77

In [159]:
summary_output = [{"Number of Unique Items": num_unique_items, "Average Price": average, 
                   "Number of Purchases": num_purchases, "Total Revenue": total_revenue }]
output2_df = pd.DataFrame(summary_output)
output2_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [160]:
output2_df.dtypes

Number of Unique Items      int64
Average Price             float64
Number of Purchases         int64
Total Revenue             float64
dtype: object

In [161]:
# Use Map to format all the columns
output2_df["Average Price"] = output2_df["Average Price"].map("${:.2f}".format)
output2_df["Total Revenue"] = output2_df["Total Revenue"].map("${:,}".format)
output2_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

In [162]:
output2_df.dtypes

Number of Unique Items     int64
Average Price             object
Number of Purchases        int64
Total Revenue             object
dtype: object

In [163]:
# Collecting a list of all columns within the DataFrame
purchase_data_df.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

In [170]:
#create a new table that takes these
gender_df= purchase_data_df[["Item ID","Gender", "Price"]]
gender_df

     Item ID  Gender  Price
0        108    Male   3.53
1        143    Male   1.56
2         92    Male   4.88
3        100    Male   3.27
4        131    Male   1.44
..       ...     ...    ...
775       60  Female   3.54
776      164    Male   1.63
777       67    Male   3.46
778       92    Male   4.19
779       50    Male   4.60

[780 rows x 3 columns]

In [179]:
# The following will select first unique rows for columns SN and then Gender
new_df = gender_df["Price"].sum()
new_df

2379.77

In [175]:
df = gender_df.groupby(["Item ID"])
new_df = df.count()
new_df

         Gender  Price
Item ID
0             4      4
1             4      4
2             6      6
3             6      6
4             5      5
...         ...    ...
178          12     12
179           6      6
181           5      5
182           3      3
183           3      3

[179 rows x 2 columns]